In [3]:
%run ../Jane/extract_data.py

In [33]:
nyc_zillow = zillow_data[zillow_data.City == 'New York'].copy()
nyc_zillow.head()

,RegionID,Zipcode,City,State,Metro,County,SizeRank,Date,Rent,Year
0,61639,10025,New York,NY,New York-Newark-Jersey City,New York County,1,2010-09-01,2930.0,2010
2,61637,10023,New York,NY,New York-Newark-Jersey City,New York County,3,2010-09-01,2797.0,2010
6,61616,10002,New York,NY,New York-Newark-Jersey City,New York County,7,2010-09-01,3083.0,2010
10,62037,11226,New York,NY,New York-Newark-Jersey City,Kings County,11,2010-09-01,1717.0,2010
11,61807,10467,New York,NY,New York-Newark-Jersey City,Bronx County,12,2010-09-01,1347.0,2010

In [26]:
nyc_zipcodes = zillow_data[zillow_data.City == 'New York'].Zipcode.value_counts().reset_index()['index'].to_list()

In [41]:
nyc_airqual = airqual_data[airqual_data['City'] == 'New York'].copy()
nyc_airqual.head()

          State County      City    AQIMean       Date
26386  New York  Bronx  New York  25.555341 2010-01-01
26387  New York  Bronx  New York  24.637082 2010-02-01
26388  New York  Bronx  New York  25.338308 2010-03-01
26389  New York  Bronx  New York  22.618458 2010-04-01
26390  New York  Bronx  New York  21.597693 2010-05-01

In [34]:
nyc_persinc = persinc_data[persinc_data.City == 'New York'].copy()
nyc_persinc

        City  Year  PersonalIncome
2   New York  2008           48585
6   New York  2009           46606
10  New York  2010           46919
14  New York  2011           48043
18  New York  2012           49407
22  New York  2013           49511
26  New York  2014           51102
30  New York  2015           52904
34  New York  2016           53694
38  New York  2017           55716
42  New York  2018           56922
46  New York  2019           58355

In [7]:
inclvl_data

          Date           Vol  VolUnadjusted income_level_group
2   2005-01-01  4.578106e+09   3.978007e+09           Moderate
3   2005-01-01  7.635135e+08   6.517910e+08                Low
6   2005-02-01  4.563908e+09   3.900504e+09           Moderate
7   2005-02-01  7.558710e+08   6.549358e+08                Low
10  2005-03-01  4.762458e+09   4.775794e+09           Moderate
..         ...           ...            ...                ...
643 2018-05-01  8.904970e+08   9.429447e+08                Low
646 2018-06-01  4.398129e+09   4.513570e+09           Moderate
647 2018-06-01  8.982546e+08   9.167395e+08                Low
650 2018-07-01  4.220966e+09   4.625639e+09           Moderate
651 2018-07-01  8.639582e+08   9.420156e+08                Low

[326 rows x 4 columns]

In [35]:
nyc_census = census_data[census_data.Zipcode.isin(nyc_zipcodes)].copy()
nyc_census.head()

,geo_id,do_date,total_pop,households,male_pop,female_pop,median_age,male_under_5,male_5_to_9,male_10_to_14,...,sales_office_employed,in_grades_1_to_4,in_grades_5_to_8,in_grades_9_to_12,in_school,in_undergrad_college,speak_only_english_at_home,speak_spanish_at_home,speak_spanish_at_home_low_english,Zipcode
2440,10471,2014-01-01,21896,8598,10378,11518,44.9,646,429,473,...,2064.0,726,752,661,5457,2287,NaN,NaN,NaN,10471
2699,11210,2014-01-01,67040,22267,30595,36445,35.6,2522,2510,2360,...,5966.0,4180,4063,4559,20778,4850,NaN,NaN,NaN,11210
2752,11232,2014-01-01,27602,8812,14304,13298,33.8,765,919,657,...,2524.0,1699,1084,1197,6057,1075,NaN,NaN,NaN,11232
2890,11428,2014-01-01,18929,5558,9208,9721,40.8,501,532,480,...,2341.0,827,827,1033,5022,1470,NaN,NaN,NaN,11428
2979,11427,2014-01-01,24037,7500,11886,12151,42.0,914,707,594,...,2590.0,995,891,937,5458,1522,NaN,NaN,NaN,11427